In [1]:
import pandas as pd

In [90]:
df = pd.read_csv(r"C:\Users\rajaa\PycharmProjects\OOP\hotels.csv")

In [4]:
df

    id                     name        city  capacity available
0  134  Tourist Sunny Apartment   Anchorage         4       yes
1  188              Snow Palace   New Delhi         5        no
2  655           City Break Inn  Porto-Novo         3        no

In [6]:
df.loc[df['id']==134]

    id                     name       city  capacity available
0  134  Tourist Sunny Apartment  Anchorage         4       yes

In [8]:
df.loc[df['id']==134, 'available'].squeeze()

'yes'

In [20]:
df[df['id'] == 134]

    id                     name       city  capacity available
0  134  Tourist Sunny Apartment  Anchorage         4       yes

In [27]:
df.loc[df['id'] == 188, 'available'].squeeze()

'yes'

In [25]:
df

    id                     name        city  capacity available
0  134  Tourist Sunny Apartment   Anchorage         4        no
1  188              Snow Palace   New Delhi         5       yes
2  655           City Break Inn  Porto-Novo         3        no

In [28]:
df.loc[df['name']=='Tourist Sunny Apartment']['capacity']

0    4
Name: capacity, dtype: int64

In [32]:
df.loc[df['name']=='Tourist Sunny Apartment', 'capacity']=5

In [33]:
df.loc[df['name']=='Tourist Sunny Apartment', 'capacity']

0    5
Name: capacity, dtype: int64

In [34]:
df.loc[df['name']=='Snow Palace', 'capacity']

1    5
Name: capacity, dtype: int64

In [35]:
df2= pd.read_csv(r"C:\Users\rajaa\PycharmProjects\OOP\articles.csv")

In [38]:
df2.loc[df2['id']==100]['in stock'].squeeze()

87

In [39]:
df2.loc[df2['id']==100]['in stock'].squeeze() - 1

86

In [41]:
df2.loc[df2['id']==100, 'in stock'] =  df2.loc[df2['id']==100]['in stock'].squeeze() - 1

In [42]:
df2

    id            name   price  in stock
0  100  laptop sven 10  999.00        86
1  101     mouse clara   12.99        87

In [43]:
df2.loc[df2['id']==100, 'in stock'] =  df2.loc[df2['id']==100]['in stock'].squeeze() - 1

In [44]:
df2

    id            name   price  in stock
0  100  laptop sven 10  999.00        85
1  101     mouse clara   12.99        87

In [45]:
df3= pd.read_csv(r"C:\Users\rajaa\PycharmProjects\OOP\card_security.csv")

In [46]:
df3

             number password
0  1234567890123456   mypass

In [49]:
df3["password"].squeeze()

'mypass'

In [54]:
v=df3["password"].squeeze()

In [55]:
v

'mypass'

In [91]:
df.loc[df['id'] == 134,'available']

0    no
Name: available, dtype: object

In [92]:
df.loc[df['id'] == 188,'available']='no'

In [93]:
df

    id                     name        city  capacity available
0  134  Tourist Sunny Apartment   Anchorage         4        no
1  188              Snow Palace   New Delhi         5        no
2  655           City Break Inn  Porto-Novo         3        no

In [94]:
df.to_csv("hotels.csv")